'''
Напишите программу, которая будет преобразовывать десятичное число в двоичное.
Пример:
- 45 -> 101101
- 3 -> 11
- 2 -> 10
'''

n = int(input ("Введите целое неотрицательное число    "))
number = ""
if (n == 0):
    number = "0"
else:
    while (n >= 1):
       rem = n % 2
       number += str(rem)
       n = int(n/2)
binary = number[::-1]
print(binary)

